In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
s=pd.Series([1,2,4,np.nan, 5,6])
s

0    1.0
1    2.0
2    4.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [7]:
dates=pd.date_range('20120201', periods=6)
dates

DatetimeIndex(['2012-02-01', '2012-02-02', '2012-02-03', '2012-02-04',
               '2012-02-05', '2012-02-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

In [10]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20120201'),
                   'C':pd.Series(1,index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E':pd.Categorical(['test','train','test','train']),
                    'F':'foo'})

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2012-02-01  1.0  3   test  foo
1  1.0 2012-02-01  1.0  3  train  foo
2  1.0 2012-02-01  1.0  3   test  foo
3  1.0 2012-02-01  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df2.head()

     A          B    C  D      E    F
0  1.0 2012-02-01  1.0  3   test  foo
1  1.0 2012-02-01  1.0  3  train  foo
2  1.0 2012-02-01  1.0  3   test  foo
3  1.0 2012-02-01  1.0  3  train  foo

In [15]:
df.index

DatetimeIndex(['2012-02-01', '2012-02-02', '2012-02-03', '2012-02-04',
               '2012-02-05', '2012-02-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.T

   2012-02-01  2012-02-02  2012-02-03  2012-02-04  2012-02-05  2012-02-06
A    0.307992    0.451498    0.166141   -0.261989   -0.449842    1.588087
B   -0.131433    1.671272   -0.123910   -0.916649    0.822816   -1.052480
C    0.119070   -0.445854    1.359938   -0.163884    1.269930   -0.371417
D   -1.120167   -0.128088    0.254318   -1.496001   -1.034643   -0.682028

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2012-02-01 -1.120167  0.119070 -0.131433  0.307992
2012-02-02 -0.128088 -0.445854  1.671272  0.451498
2012-02-03  0.254318  1.359938 -0.123910  0.166141
2012-02-04 -1.496001 -0.163884 -0.916649 -0.261989
2012-02-05 -1.034643  1.269930  0.822816 -0.449842
2012-02-06 -0.682028 -0.371417 -1.052480  1.588087

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2012-02-06  1.588087 -1.052480 -0.371417 -0.682028
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001
2012-02-01  0.307992 -0.131433  0.119070 -1.120167
2012-02-03  0.166141 -0.123910  1.359938  0.254318
2012-02-05 -0.449842  0.822816  1.269930 -1.034643
2012-02-02  0.451498  1.671272 -0.445854 -0.128088

In [24]:
df.loc[dates[3]]

A   -0.261989
B   -0.916649
C   -0.163884
D   -1.496001
Name: 2012-02-04 00:00:00, dtype: float64

In [25]:
df3=df.copy()

In [31]:
df['E']=['one', 'two', 'three', 'four', 'two', 'three']

In [32]:
df

                   A         B         C         D      E
2012-02-01  0.307992 -0.131433  0.119070 -1.120167    one
2012-02-02  0.451498  1.671272 -0.445854 -0.128088    two
2012-02-03  0.166141 -0.123910  1.359938  0.254318  three
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001   four
2012-02-05 -0.449842  0.822816  1.269930 -1.034643    two
2012-02-06  1.588087 -1.052480 -0.371417 -0.682028  three

In [33]:
df[df['E'].isin(['two', 'three'])]

                   A         B         C         D      E
2012-02-02  0.451498  1.671272 -0.445854 -0.128088    two
2012-02-03  0.166141 -0.123910  1.359938  0.254318  three
2012-02-05 -0.449842  0.822816  1.269930 -1.034643    two
2012-02-06  1.588087 -1.052480 -0.371417 -0.682028  three

In [36]:
df1=df.reindex(index=dates[0:4], columns=list(df.columns))

In [37]:
df1

                   A         B         C         D      E
2012-02-01  0.307992 -0.131433  0.119070 -1.120167    one
2012-02-02  0.451498  1.671272 -0.445854 -0.128088    two
2012-02-03  0.166141 -0.123910  1.359938  0.254318  three
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001   four

In [40]:
df1.loc[dates[0]:dates[1], 'E']= np.NaN

In [41]:
df1

                   A         B         C         D      E
2012-02-01  0.307992 -0.131433  0.119070 -1.120167    NaN
2012-02-02  0.451498  1.671272 -0.445854 -0.128088    NaN
2012-02-03  0.166141 -0.123910  1.359938  0.254318  three
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001   four

In [43]:
df1.dropna(how='any')

                   A         B         C         D      E
2012-02-03  0.166141 -0.123910  1.359938  0.254318  three
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001   four

In [44]:
df1

                   A         B         C         D      E
2012-02-01  0.307992 -0.131433  0.119070 -1.120167    NaN
2012-02-02  0.451498  1.671272 -0.445854 -0.128088    NaN
2012-02-03  0.166141 -0.123910  1.359938  0.254318  three
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001   four

In [46]:
df1.fillna(value=np.mean(df.C))

                   A         B         C         D        E
2012-02-01  0.307992 -0.131433  0.119070 -1.120167  0.29463
2012-02-02  0.451498  1.671272 -0.445854 -0.128088  0.29463
2012-02-03  0.166141 -0.123910  1.359938  0.254318    three
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001     four

In [47]:
pd.isna(df1)

                A      B      C      D      E
2012-02-01  False  False  False  False   True
2012-02-02  False  False  False  False   True
2012-02-03  False  False  False  False  False
2012-02-04  False  False  False  False  False

In [48]:
df.mean(0)

A    0.300314
B    0.044936
C    0.294630
D   -0.701101
dtype: float64

In [59]:
s=pd.Series([1,2,4, np.nan, 5,6], index=dates).shift(3)
s

2012-02-01    NaN
2012-02-02    NaN
2012-02-03    NaN
2012-02-04    1.0
2012-02-05    2.0
2012-02-06    4.0
Freq: D, dtype: float64

In [67]:
df.apply(np.cumsum)

                   A         B         C         D                        E
2012-02-01  0.307992 -0.131433  0.119070 -1.120167                      one
2012-02-02  0.759489  1.539839 -0.326784 -1.248255                   onetwo
2012-02-03  0.925630  1.415929  1.033153 -0.993937              onetwothree
2012-02-04  0.663641  0.499280  0.869270 -2.489938          onetwothreefour
2012-02-05  0.213799  1.322096  2.139200 -3.524581       onetwothreefourtwo
2012-02-06  1.801886  0.269616  1.767783 -4.206608  onetwothreefourtwothree

In [70]:
del df['E']

In [71]:
df

                   A         B         C         D
2012-02-01  0.307992 -0.131433  0.119070 -1.120167
2012-02-02  0.451498  1.671272 -0.445854 -0.128088
2012-02-03  0.166141 -0.123910  1.359938  0.254318
2012-02-04 -0.261989 -0.916649 -0.163884 -1.496001
2012-02-05 -0.449842  0.822816  1.269930 -1.034643
2012-02-06  1.588087 -1.052480 -0.371417 -0.682028

In [72]:
df=pd.DataFrame(np.random.rand(10,4))

In [73]:
df

          0         1         2         3
0  0.707501  0.369663  0.385701  0.705567
1  0.968794  0.861466  0.687949  0.768290
2  0.802919  0.512529  0.451988  0.167636
3  0.665856  0.973982  0.995832  0.933492
4  0.290722  0.654753  0.584004  0.090769
5  0.852846  0.081832  0.262957  0.034192
6  0.607729  0.255977  0.706447  0.504823
7  0.200407  0.903482  0.858288  0.866284
8  0.373715  0.074982  0.430599  0.000173
9  0.694261  0.276457  0.131396  0.708923

In [75]:
pieces=[df[:3],df[3:7],df[7:]]

In [76]:
pieces

[          0         1         2         3
 0  0.707501  0.369663  0.385701  0.705567
 1  0.968794  0.861466  0.687949  0.768290
 2  0.802919  0.512529  0.451988  0.167636,
           0         1         2         3
 3  0.665856  0.973982  0.995832  0.933492
 4  0.290722  0.654753  0.584004  0.090769
 5  0.852846  0.081832  0.262957  0.034192
 6  0.607729  0.255977  0.706447  0.504823,
           0         1         2         3
 7  0.200407  0.903482  0.858288  0.866284
 8  0.373715  0.074982  0.430599  0.000173
 9  0.694261  0.276457  0.131396  0.708923]

In [77]:
pd.concat(pieces)

          0         1         2         3
0  0.707501  0.369663  0.385701  0.705567
1  0.968794  0.861466  0.687949  0.768290
2  0.802919  0.512529  0.451988  0.167636
3  0.665856  0.973982  0.995832  0.933492
4  0.290722  0.654753  0.584004  0.090769
5  0.852846  0.081832  0.262957  0.034192
6  0.607729  0.255977  0.706447  0.504823
7  0.200407  0.903482  0.858288  0.866284
8  0.373715  0.074982  0.430599  0.000173
9  0.694261  0.276457  0.131396  0.708923

In [78]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [79]:
left

   key  lval
0  foo     1
1  foo     2

In [80]:
right

   key  rval
0  foo     4
1  foo     5

In [81]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [82]:
 df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [83]:
df

          A         B         C         D
0  1.066451  1.441989 -1.285591 -1.083476
1  1.295223  1.232306 -0.679465  2.448137
2 -0.736776 -0.303615 -0.771225 -1.736104
3 -2.723110  1.399629 -0.221545  1.058114
4  0.303779  1.222486 -2.676013  0.322068
5  1.591943  0.283764 -2.133776  0.571559
6 -2.336965 -0.189911 -0.359139  0.467714
7 -0.415612 -0.894524 -1.383031  1.301815

In [86]:
s=df.loc[3]

In [87]:
s

A   -2.723110
B    1.399629
C   -0.221545
D    1.058114
Name: 3, dtype: float64

In [88]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.066451  1.441989 -1.285591 -1.083476
1  1.295223  1.232306 -0.679465  2.448137
2 -0.736776 -0.303615 -0.771225 -1.736104
3 -2.723110  1.399629 -0.221545  1.058114
4  0.303779  1.222486 -2.676013  0.322068
5  1.591943  0.283764 -2.133776  0.571559
6 -2.336965 -0.189911 -0.359139  0.467714
7 -0.415612 -0.894524 -1.383031  1.301815
8 -2.723110  1.399629 -0.221545  1.058114

In [89]:
 df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                       'B' : ['one', 'one', 'two', 'three',
                             'two', 'two', 'one', 'three'],
                       'C' : np.random.randn(8),
                      'D' : np.random.randn(8)})

In [90]:
df

     A      B         C         D
0  foo    one  0.166468 -0.025203
1  bar    one -0.210278 -1.063102
2  foo    two -0.348476  1.577328
3  bar  three -0.777329  0.449566
4  foo    two -0.776106 -0.622473
5  bar    two  2.460874  0.907973
6  foo    one -0.059679  0.901927
7  foo  three -2.136194  0.441764

In [92]:
df.groupby(by='A').sum()

            C         D
A
bar  1.473267  0.294438
foo -3.153987  2.273342

In [94]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.210278 -1.063102
    three -0.777329  0.449566
    two    2.460874  0.907973
foo one    0.106789  0.876724
    three -2.136194  0.441764
    two   -1.124582  0.954855

In [95]:
tuples=list(zip(*[['bar', 'bar','baz', 'baz', 
                   'goo','goo', 'quz','quz'],['one', 'two','one', 'two',
                    'one','two', 'one', 'two']]))

In [96]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('goo', 'one'),
 ('goo', 'two'),
 ('quz', 'one'),
 ('quz', 'two')]

In [97]:
df2=df[:4]

In [98]:
df2

     A      B         C         D
0  foo    one  0.166468 -0.025203
1  bar    one -0.210278 -1.063102
2  foo    two -0.348476  1.577328
3  bar  three -0.777329  0.449566

In [99]:
stacked =df2.stack()

In [100]:
stacked

0  A          foo
   B          one
   C     0.166468
   D   -0.0252029
1  A          bar
   B          one
   C    -0.210278
   D      -1.0631
2  A          foo
   B          two
   C    -0.348476
   D      1.57733
3  A          bar
   B        three
   C    -0.777329
   D     0.449566
dtype: object

In [101]:
stacked.unstack()

     A      B         C          D
0  foo    one  0.166468 -0.0252029
1  bar    one -0.210278    -1.0631
2  foo    two -0.348476    1.57733
3  bar  three -0.777329   0.449566

In [102]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})

In [103]:
df

        A  B    C         D         E
0     one  A  foo  1.219535  1.439757
1     one  B  foo  1.205325  1.166407
2     two  C  foo  0.320303 -0.227366
3   three  A  bar  1.100841 -1.622466
4     one  B  bar -0.136663  1.531980
5     one  C  bar  0.162188  0.445688
6     two  A  foo  0.494814 -0.450773
7   three  B  foo -1.505436 -1.533878
8     one  C  foo  2.001998  0.840107
9     one  A  bar  0.871023 -0.743206
10    two  B  bar -0.077023  0.674745
11  three  C  bar  2.392396  0.570650

In [104]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.871023  1.219535
      B -0.136663  1.205325
      C  0.162188  2.001998
three A  1.100841       NaN
      B       NaN -1.505436
      C  2.392396       NaN
two   A       NaN  0.494814
      B -0.077023       NaN
      C       NaN  0.320303

In [105]:
rng=pd.date_range('1/1/2013', periods=100, freq='S')

In [106]:
ts=pd.Series(np.random.randint(0,500, len(rng)),index=rng)

In [108]:
ts.resample('5Min').sum().astype('int32')

2013-01-01    25663
Freq: 5T, dtype: int32

In [109]:
ts_utc=ts.tz_localize('UTC')

In [111]:
ts_utc.head()

2013-01-01 00:00:00+00:00    103
2013-01-01 00:00:01+00:00     98
2013-01-01 00:00:02+00:00    184
2013-01-01 00:00:03+00:00    312
2013-01-01 00:00:04+00:00    492
Freq: S, dtype: int64

In [113]:
ts_utc.tz_convert('US/Eastern').head()

2012-12-31 19:00:00-05:00    103
2012-12-31 19:00:01-05:00     98
2012-12-31 19:00:02-05:00    184
2012-12-31 19:00:03-05:00    312
2012-12-31 19:00:04-05:00    492
Freq: S, dtype: int64

In [114]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [115]:
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [116]:
ts=pd.Series(np.random.randn(len(prng)), prng)

In [117]:
ts.head()

1990Q1    1.150088
1990Q2   -1.043768
1990Q3   -0.652866
1990Q4    0.259899
1991Q1   -1.740248
Freq: Q-NOV, dtype: float64

In [118]:
 ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [120]:
ts.index[0:10]

PeriodIndex(['1990-03-01 09:00', '1990-06-01 09:00', '1990-09-01 09:00',
             '1990-12-01 09:00', '1991-03-01 09:00', '1991-06-01 09:00',
             '1991-09-01 09:00', '1991-12-01 09:00', '1992-03-01 09:00',
             '1992-06-01 09:00'],
            dtype='period[H]', freq='H')